INSERT INTO public.client (last_name,first_name,middle_name,license_num,birth_date,reg_date) VALUES
	 ('Иванов','Иван','Петрович','77АА123456','1990-05-15','2023-01-15'),
	 ('Петрова','Мария','Сергеевна','78ВВ234567','1985-08-23','2023-02-20'),
	 ('Сидоров','Алексей','Владимирович','99СС345678','2000-11-02','2023-03-10'),
	 ('Козлова','Елена','Андреевна','11ДД456789','1992-03-18','2023-04-01'),
	 ('Новиков','Дмитрий','Алексеевич','22ЕЕ567890','1988-07-25','2023-04-15'),
	 ('Морозова','Анна','Ивановна','33ЖЖ678901','1995-12-01','2023-05-01'),
	 ('Волков','Андрей','Сергеевич','44ЗЗ789012','1991-09-14','2023-05-20'),
	 ('Соколова','Татьяна','Павловна','55ИИ890123','1983-06-30','2023-06-01'),
	 ('Михайлов','Сергей','Дмитриевич','66КК901234','1998-02-28','2023-06-15'),
	 ('Фёдорова','Анна','Андреевна','77ЛЛ012345','1993-11-11','2023-07-01');
INSERT INTO public.client (last_name,first_name,middle_name,license_num,birth_date,reg_date) VALUES
	 ('Павлов','Николай','Евгеньевич','88ММ123456','1987-04-22','2023-07-20'),
	 ('Семёнова','Екатерина','Сергеевна','99НН234567','1996-08-08','2023-08-01'),
	 ('Алексеев','Павел','Валерьевич','00ОО345678','1990-01-17','2023-08-15'),
	 ('Лебедева','Ирина','Петровна','12ПП456789','1994-05-25','2023-09-01'),
	 ('Кузьмин','Максим','Сергеевич','34РР567890','1999-10-10','2023-09-15'),
	 ('Егорова','Светлана','Александровна','56СС678901','1991-12-03','2023-10-01'),
	 ('Тарасов','Виталий','Романович','78ТТ789012','1989-03-15','2023-10-20'),
	 ('Ильина','Наталья','Владимировна','90УУ890123','1997-07-19','2023-11-01'),
	 ('Степанов','Георгий','Михайлович','12ФФ901234','1986-09-05','2023-11-15'),
	 ('Орлова','Алина','Денисовна','34ХХ012345','1994-01-27','2023-12-01');
INSERT INTO public.client (last_name,first_name,middle_name,license_num,birth_date,reg_date) VALUES
	 ('Макаров','Артём','Иванович','56ЦЦ123456','2001-04-12','2024-01-10'),
	 ('Никитина','Вероника','Алексеевна','78ЧЧ234567','1992-06-23','2024-01-25'),
	 ('Захаров','Кирилл','Андреевич','90ШШ345678','1995-10-30','2024-02-10'),
	 ('Григорьева','Полина','Евгеньевна','12ЩЩ456789','1988-11-14','2024-02-20'),
	 ('Соловьёв','Роман','Олегович','34ЪЪ567890','1993-07-08','2024-03-01'),
	 ('Медведева','Юлия','Александровна','56ЫЫ678901','1996-09-17','2024-03-15'),
	 ('Белов','Вадим','Сергеевич','78ЬЬ789012','2000-02-29','2024-04-01'),
	 ('Андреева','Дарья','Максимовна','90ЭЭ890123','1998-05-01','2024-04-15'),
	 ('Тимофеев','Егор','Денисович','12ЮЮ901234','1991-12-24','2024-05-01'),
	 ('Крылова','Валерия','Романовна','34ЯЯ012345','1997-03-20','2024-05-15');
